/*
Реализовать простой калькулятор
 */

// Реализовал калькулятор с 5-ю действиями и скобками. Такой делали на курсе Python.
// Алгоритм остался прежний, переписал толко код с Python на  Java
public class Main {
    public static void main(String[] args) {
        MyCalculator calc = new MyCalculator();
        String[] arr = new String[] {
                "12*3+3+5+2*2",
                "1+2*(3+5)",
                "15/(7-(1+1))*3-(2+(1+1))",
                "2^5",
                "-2*5",
                "-2^5",
                "2+2",
                "1+2*3",
                "1-2*3",
                "1+2*3",
                "(1+2)*3",
                "1/2+1/3",
                "1-22/22-2/2*2+1",
                "(35.57*4^3*2-3^2^3/(3+5^5-1.33)-(46*(7.7-1.12/(5*97^2-3.36))*(1.1-0.09)-(0.01+1)-74*(59+1-98)/31+58)*61-7*(1+2*6.6666))/(3*366.98/(2+2*2)+98.98)+989",
        };
        for (String s: arr){
            System.out.printf("Вычисляем: '%s' = %s\n"
                    ,s
                    ,calc.Calculate(s)
            );
        }
    }
}

/* Вывод Программы
Вычисляем: '12*3+3+5+2*2' = 48.0
Вычисляем: '1+2*(3+5)' = 17.0
Вычисляем: '15/(7-(1+1))*3-(2+(1+1))' = 5.0
Вычисляем: '2^5' = 32.0
Вычисляем: '-2*5' = -10.0
Вычисляем: '-2^5' = -32.0
Вычисляем: '2+2' = 4.0
Вычисляем: '1+2*3' = 7.0
Вычисляем: '1-2*3' = -5.0
Вычисляем: '1+2*3' = 7.0
Вычисляем: '(1+2)*3' = 9.0
Вычисляем: '1/2+1/3' = 0.8333333333333333
Вычисляем: '1-22/22-2/2*2+1' = -1.0
Вычисляем: '(35.57*4^3*2-3^2^3/(3+5^5-1.33)-(46*(7.7-1.12/(5*97^2-3.36))*(1.1-0.09)-(0.01+1)-74*(59+1-98)/31+58)*61-7*(1+2*6.6666))/(3*366.98/(2+2*2)+98.98)+989' = 5763294.284121781
 */